In [1]:
import pandas as pd
import numpy as np
# copying the files
file1 = pd.read_csv('./file1.csv')
file2 = pd.read_csv('./file2.csv')
file3 = pd.read_csv('./file3.csv')

In [2]:
#show the shape
display(file1.shape)
display(file2.shape)
display(file3.shape)

(4008, 11)

(996, 11)

(7070, 11)

In [3]:
#Standardize header names
#show headers
display(file1.head(3))
display(file2.head(3))
display(file3.head(3))

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car

In [4]:
#Rename headers
file1 = file1.rename(columns={'GENDER':'Gender'})
file2 = file2.rename(columns={'GENDER':'Gender'})
file3 = file3.rename(columns={'State':'ST'})
display(file1.head(3))
display(file2.head(3))
display(file3.head(3))

,Customer,ST,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

,Customer,ST,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car

,Customer,ST,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car

In [5]:
#check the order
display(file1.columns)

Index(['Customer', 'ST', 'Gender', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [6]:
#rearrange
file2= file2[ ['Customer', 'ST', 'Gender', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'] ]

file3= file3[ ['Customer', 'ST', 'Gender', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'] ]
#checking if it worked
display((file2.columns==file1.columns) & (file3.columns==file1.columns))

array([ True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True])

In [7]:
#converting percentages to numericals
file1['Customer Lifetime Value'] = file1['Customer Lifetime Value'].str.replace('%','')
file1['Customer Lifetime Value'] = pd.to_numeric(file1['Customer Lifetime Value'],errors = "coerce")
file2['Customer Lifetime Value'] = file2['Customer Lifetime Value'].str.replace('%','')
file2['Customer Lifetime Value'] = pd.to_numeric(file2['Customer Lifetime Value'],errors = "coerce")

In [8]:
#check if conversion worked
file1.dtypes
#divide by 100
file1['Customer Lifetime Value'] = file1['Customer Lifetime Value']/100

In [9]:
file2['Customer Lifetime Value'] = file2['Customer Lifetime Value']/100

In [10]:
#check if it worked
display(file1.head(5))
display(file2.head(5))

,Customer,ST,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,6979.5359,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,12887.4317,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,7645.8618,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,5363.0765,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

,Customer,ST,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,GS98873,Arizona,F,Bachelor,3239.1247,16061,88,1/0/00,Personal Auto,Four-Door Car,633.6
1,CW49887,California,F,Master,4626.8011,79487,114,1/0/00,Special Auto,SUV,547.2
2,MY31220,California,F,College,8997.0402,54230,112,1/0/00,Personal Auto,Two-Door Car,537.6
3,UH35128,Oregon,F,College,25807.0630,71210,214,1/1/00,Personal Auto,Luxury Car,1027.2
4,WH52799,Arizona,F,College,3808.1221,94903,94,1/0/00,Corporate Auto,Two-Door Car,451.2

In [11]:
#concatenate the dataframes
datafull = pd.concat([file1, file2, file3], axis = 0)
#see if it worked
datafull.shape

(12074, 11)

In [12]:
#which is numerical which is categorical?
datafull.dtypes
# State, Gender, Education, Policy type and Vehicle class are categorical
# Customer, Customer lifetime value, Income, Monthly premium auto, total claim amount and Number of open complaints are numerical

Customer                      object
ST                            object
Gender                        object
Education                     object
Customer Lifetime Value      float64
Income                       float64
Monthly Premium Auto         float64
Number of Open Complaints     object
Policy Type                   object
Vehicle Class                 object
Total Claim Amount           float64
dtype: object

In [13]:
# Understand the meaning of all columns

# Customer The Identification number of the individual customer
# ST The state in which the customer resides
# Gender The gender of the customer
# Education The highest degree of the customer
# Customer Lifetime Value The total amount spent by the customer since recording
# Income The customers income
# Monthly premium auto Automatically recurring payments by customer
# Number of Open Complaints Number of unresolves complaints by the cutomer
# Policy Type What class of car is insured, Personal, Corporate or Special
# Vehicle Class What kind of car is insured
# Total Claim Amount Total sum of insurance payments claimed by customer

In [14]:
# Perform the data cleaning operations mentioned so far in class

#Delete the column education and the number of open complaints from the dataframe.
datafull = datafull.drop(['Education','Number of Open Complaints'], axis=1)
#check if it worked
datafull.head()

,Customer,ST,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,6979.5359,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,12887.4317,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,7645.8618,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,5363.0765,36357.0,68.0,Personal Auto,Four-Door Car,17.269323

In [15]:
# correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.
# Done earlier before we concatenated, like reconmendet

In [16]:
#check for duplicates
print(datafull[datafull.duplicated()])

     Customer          ST Gender  Customer Lifetime Value   Income  \
1072      NaN         NaN    NaN                      NaN      NaN
1073      NaN         NaN    NaN                      NaN      NaN
1074      NaN         NaN    NaN                      NaN      NaN
1075      NaN         NaN    NaN                      NaN      NaN
1076      NaN         NaN    NaN                      NaN      NaN
...       ...         ...    ...                      ...      ...
4006      NaN         NaN    NaN                      NaN      NaN
4007      NaN         NaN    NaN                      NaN      NaN
0     GS98873     Arizona      F                3239.1247  16061.0
1     CW49887  California      F                4626.8011  79487.0
2     MY31220  California      F                8997.0402  54230.0

      Monthly Premium Auto    Policy Type  Vehicle Class  Total Claim Amount
1072                   NaN            NaN            NaN                 NaN
1073                   NaN            NaN            NaN                 NaN
1074                   NaN            NaN            NaN                 NaN
1075                   NaN            NaN            NaN                 NaN
1076                   NaN            NaN            NaN                 NaN
...                    ...            ...            ...                 ...
4006                   NaN            NaN            NaN                 NaN
4007                   NaN            NaN            NaN                 NaN
0                     88.0  Personal Auto  Four-Door Car               633.6
1                    114.0   Special Auto            SUV               547.2
2                    112.0  Personal Auto   Two-Door Car               537.6

[2939 rows x 9 columns]

In [17]:
# Check for duplicate rows in the data and remove if any.
display(datafull.shape)
datafull = datafull.drop_duplicates()

(12074, 9)

In [18]:
#check if it worked
print(datafull[datafull.duplicated()])
print(file2.duplicated().sum())
print(datafull.shape)

Empty DataFrame
Columns: [Customer, ST, Gender, Customer Lifetime Value, Income, Monthly Premium Auto, Policy Type, Vehicle Class, Total Claim Amount]
Index: []
0
(9135, 9)

In [19]:
# Filter out the data for customers who have an income of 0 or less.
datafull = datafull[datafull['Income'] > 0]

In [20]:
#check if it worked
print(datafull.shape)
print(datafull.head(3))

(6840, 9)
  Customer          ST Gender  Customer Lifetime Value   Income  \
2  AI49188      Nevada      F               12887.4317  48767.0
4  GA49547  Washington      M                5363.0765  36357.0
5  OC83172      Oregon      F                8256.2978  62902.0

   Monthly Premium Auto    Policy Type  Vehicle Class  Total Claim Amount
2                 108.0  Personal Auto   Two-Door Car          566.472247
4                  68.0  Personal Auto  Four-Door Car           17.269323
5                  69.0  Personal Auto   Two-Door Car          159.383042

In [21]:
# checking for NULL values
datafull.isna().sum()

Customer                    0
ST                          0
Gender                     98
Customer Lifetime Value     5
Income                      0
Monthly Premium Auto        0
Policy Type                 0
Vehicle Class               0
Total Claim Amount          0
dtype: int64

In [22]:
# assigning the mean value to the data lifetime values to minimize error
import numpy as np
mean_CLV = datafull['Customer Lifetime Value'].mean()
print(mean_CLV)
datafull['Customer Lifetime Value'] = datafull['Customer Lifetime Value'].fillna(mean_CLV)

8112.223294125396

In [23]:
# Check if there are no more NULL in Customer Livetime Value and mean stays the same
print(datafull['Customer Lifetime Value'].mean())
datafull.isna().sum()

8112.223294125395

Customer                    0
ST                          0
Gender                     98
Customer Lifetime Value     0
Income                      0
Monthly Premium Auto        0
Policy Type                 0
Vehicle Class               0
Total Claim Amount          0
dtype: int64

In [24]:
# Checking for the consitency in the declaration of State, Gender, Policy Type and Vehicle Class
for i in ['ST','Gender','Policy Type','Vehicle Class']:
    print(datafull[i].unique())

['Nevada' 'Washington' 'Oregon' 'California' 'Arizona' 'Cali' 'AZ' 'WA']
['F' 'M' nan 'Femal' 'Male' 'female']
['Personal Auto' 'Corporate Auto' 'Special Auto']
['Two-Door Car' 'Four-Door Car' 'SUV' 'Luxury SUV' 'Sports Car'
 'Luxury Car']

In [25]:
# Restoring consistency in the declaration of gender
# Checking the distribution
datafull['Gender'].value_counts(dropna = False)

F         3460
M         3223
NaN         98
Male        27
female      20
Femal       12
Name: Gender, dtype: int64

In [26]:

#defining a function to take values and return the replacement values
def clean(x):
    # Why does this line not work with 1 operand? I went cracy over this :D
    # if x in ('M'):    doesnt work
    # if x == 'M':    doesnt work
    if x in ('M','Male'):
        return 'Male'
    elif x in ('F','Femal','female'):
        return 'Female'
    
# using the map function to apply our cleaning function to all values in Gender    
datafull['Gender'] = list(map(clean, datafull['Gender']))

In [27]:
# Checking again
print(datafull['Gender'].unique())
print(datafull['Gender'].value_counts(dropna = False))

['Female' 'Male' None]
Female    3492
Male      3250
None        98
Name: Gender, dtype: int64

In [28]:
# Counting the males and females to see what to do with the NULL values
datafull['Gender'].value_counts(dropna = False)

Female    3492
Male      3250
None        98
Name: Gender, dtype: int64

In [29]:
# Since there are more females we assign NULL values to Females
datafull['Gender'] = datafull['Gender'].fillna('Female')

In [30]:
# Check if it worked
datafull['Gender'].value_counts(dropna = False)

Female    3590
Male      3250
Name: Gender, dtype: int64